Repository: biglinux/bigapache
Catalog: bigapache/DEBIAN/*.po
Languages: es

source: Desenvolvimento WEB
es: El desarrollo de la WEB

source: Instale servidores e outras facilidades
es: Instale los servidores y el resto de instalaciones

source: GPL v2 ou maior
es: La GPL v2 o superior

source: Configuração aplicada!
es: Configuración de aplicación!

source: Voltar
es: Volver

source: Fechar
es: Cerrar

source: O servidor Apache está instalado.
es: El servidor Apache está instalado.

source: O servidor Apache não está instalado.
es: El servidor Apache no está instalado.

source: O servidor MariaDB (Mysql) está instalado.
es: El servidor MariaDB (Mysql) está instalado.

source: Lembre que o usuário root pode ser acessado apenas no terminal e utilizando o usuário root do sistema.
es: Lembre que el usuario root puede ser acessado solo por el terminal y utilizando el usuario root del sistema.

source: Para utilizar sistemas web que precisem conectar no banco de dados, utilize a opção “Gerenciar o MariaDB (Mysql)” e selecione a opção alterar senha do usuário admin. Então será criado o usuário de nome admin com a senha que você escolher, esse usuário possui todos os poderes administrativos e pode ser acessado utilizando php.
es: Para usar sistemas web que necesitan conectarse a la base de datos, use la opción "Administrar MariaDB (Mysql)" y seleccione la opción para cambiar la contraseña del usuario administrador. Luego se creará el nombre de usuario admin con la contraseña que elija, ese usuario tiene poderes administrativos y se puede acceder mediante php.

source: O servidor MariaDB (Mysql) não está instalado.
es: El servidor MariaDB (Mysql) no está instalado.

source: O Phpmyadmin está instalado.
es: El Phpmyadmin está instalado.

source: O Phpmyadmin não está instalado.
es: El Phpmyadmin no está instalado.

source: Download concluído
es: Descarga completa

source: Servidor WEB Apache
es: El Servidor de WEB Apache

source: Desinstala o Apache e o suporte à PHP, Python e Perl.
es: Desinstala el Apache y el soporte para PHP, Python y Perl.

source: Remover o servidor WEB Apache
es: Para quitar el servidor de WEB de Apache

source: O Apache está funcionando no momento, utilize esta opção para fechar o servidor.
es: El Apache se está ejecutando en ese momento, el uso de esta opción para activar el servidor.

source: Parar o Apache
es: Parar el Apache

source: O Apache não está funcionando no momento, utilize esta opção para iniciar o servidor.
es: El Apache no está funcionando correctamente, puede usar esta opción para que se inicie el servidor.

source: Iniciar o Apache
es: Para Iniciar el Apache

source: O Apache está sendo iniciado automaticamente ao ligar o computador.
es: El Apache se inicia automáticamente al encender el equipo.

source: Parar de iniciar o Apache ao ligar o computador
es: Deja de arrancar el Apache, cuando encienda el ordenador

source: O Apache não está sendo iniciado automaticamente ao ligar o computador.
es: El Apache, no se inicia automáticamente al encender el equipo.

source: Marcar o Apache para iniciar ao ligar o computador
es: Marcar el Apache para que inicie al arrancar el sistema

source: Não está instalado
es: No se ha instalado

source: Instala o Apache com suporte a PHP, Python e Perl.
es: Instale el Apache con soporte para PHP, Python y Perl.

source: Instalar o servidor WEB Apache
es: Para Instalar el servidor WEB Apache

source: Servidor MariaDB (Mysql)
es: El Servidor MariaDB (Mysql).

source: Desinstala o MariaDB (Mysql).
es: Desinstala el servidor MariaDB (Mysql).

source: Remover o servidor de banco de dados MariaDB (Mysql)
es: Quitar el servidor de base de datos MariaDB (Mysql).

source: O MariaDB (Mysql) está funcionando no momento. Utilize esta opção para fechar o servidor.
es: El MariaDB (Mysql) se está ejecutando en ese momento, usa esta opción para cerrar el servidor.

source: Parar o MariaDB (Mysql)
es: Parar el MariaDB (Mysql)

source: O MariaDB (Mysql) não está funcionando no momento, utilize esta opção para iniciar o servidor.
es: El MariaDB (Mysql) no está funcionando correctamente, puede usar esta opción para que se inicie el servidor.

source: Iniciar o MariaDB (Mysql)
es: Arrancar el MariaDB (Mysql)

source: O MariaDB (Mysql) está sendo iniciado automaticamente ao ligar o computador.
es: El MariaDB (Mysql) se inicia automáticamente al encender el equipo.

source: Parar de iniciar o MariaDB (Mysql) ao ligar o computador
es: Deja de inicio de MariaDB (Mysql), al encender el ordenador

source: O MariaDB (Mysql) não está sendo iniciado automaticamente ao ligar o computador.
es: El MariaDB (Mysql) no se inicia automáticamente al encender el equipo.

source: Marcar o MariaDB (Mysql) para iniciar ao ligar o computador
es: Marcar el MariaDB (Mysql) para que inicie al arrancar el sistema

source: Instala o MariaDB (Mysql).
es: Se Instala el MariaDB (Mysql).

source: Instalar o servidor de banco de dados MariaDB (Mysql)
es: Para instalar el servidor de base de datos MariaDB (Mysql)

source: Configurações do Apache
es: La configuración de Apache

source: Configura as permissões da pasta padrão do Apache, /var/www/html, para o usuário atual: $USER. Ao fazer isto, basta acessar a pasta /var/www/html e adicionar ou modificar os arquivos com o seu usuário, sem problemas de falta de permissão.
es: Configurar los permisos de la carpeta por defecto de Apache (/var/www/html, para que el usuario activo: $USER). Al hacer esto, sólo tienes que acceder a la carpeta /var/www/html, y la adición o modificación de los archivos con su nombre de usuario, no hay problemas de falta de consentimiento.

source: Alterar as permissões dos arquivos para o usuário atual.
es: Cambiar los permisos de los archivos para que el usuario actual.

source: Configura as permissões da pasta padrão do Apache, /var/www/html, para o usuário padrão: www-data
es: Configurar los permisos de la carpeta por defecto de Apache (/var/www/html, para el usuario estándar: www-data

source: Alterar as permissões dos arquivos para o usuário padrão.
es: Cambiar los permisos de los archivos para el usuario por defecto.

source: Esta é a pasta padrão do Apache, aonde devem ficar os arquivos do seu site.
es: Esta es la carpeta por defecto del servidor Apache, donde estarán los archivos de su sitio web.

source: Abrir a pasta /var/www/html
es: Abra la carpeta en el directorio /var/www/html

source: Pasta que contêm os arquivos de configuração do Apache.
es: La carpeta que contiene los archivos de configuración de Apache.

source: Abrir a pasta de configurações /etc/apache2
es: Abrir la carpeta de configuración en /etc/apache2

source: Gerenciar o MariaDB (Mysql)
es: Administrar MariaDB (Mysql)

source: Desinstala o Phpmyadmin.
es: Desinstala el Phpmyadmin.

source: Remover o Phpmyadmin
es: Para quitar el Phpmyadmin

source: Abre o navegador na página do Phpmyadmin
es: Abre el navegador web en la página de Phpmyadmin

source: Acessar o Phpmyadmin
es: Acceder a Phpmyadmin

source: Instala o Phpmyadmin.
es: Instalar el Phpmyadmin.

source: Instalar o gerenciador de banco de dados Phpmyadmin
es: Para Instalar el administrador de la base de datos con Phpmyadmin

source: Para instalar o Phpmyadmin, instale primeiro o Apache e o MariaDB (Mysql).
es: Para instalar el Phpmyadmin, primero debe instalar el Apache y el MariaDB (Mysql).

source: Nesse sistema utilizamos dois administradores no MariaDB (Mysql), o root, utilizado apenas por linha de comando e o admin, que pode ser utilizado, por exemplo, no Phpmyadmin.
es: En este sistema, utilizamos dos de los administradores en MariaDB (Mysql) con el usuario root, solo desde la línea de comandos, y el administrador, el cual puede ser utilizado, por ejemplo, en el Phpmyadmin.

source: Alterar a senha do usuário admin do MariaDB (Mysql)
es: Para cambiar la contraseña del usuario administrador de MariaDB (Mysql)

source: Instalar ou remover editores de código
es: Para Instalar o quitar a los editores de código

source: Desinstala o editor Atom.
es: Desinstala el editor Atom.

source: Remover o Atom
es: Quitar el Atom

source: Instala o editor Atom.
es: Se Instala el editor Atom.

source: Instalar o Atom
es: Para Instalar el Atom

source: Desinstala o editor Bluefish.
es: Desinstala el editor Bluefish.

source: Remover o Bluefish
es: Para quitar el Bluefish

source: Instala o editor Bluefish.
es: Se Instala el editor Bluefish.

source: Instalar o Bluefish
es: Para Instalar el Bluefish

source: Desinstala o editor VSCodium.
es: Desinstala el editor de VSCodium.

source: Remover o VSCodium
es: Para quitar el VSCodium

source: Instala o editor VSCodium.
es: Se Instala el editor VSCodium.

source: Instalar o VSCodium
es: Para Instalar el VSCodium

source: Desinstala o editor Visual Studio Code.
es: Desinstala el editor de Visual Studio Code.

source: Remover o VSCode
es: Para quitar el VSCode

source: Instala o editor Visual Studio Code.
es: Se Instala el editor Visual Studio Code.

source: Instalar o VSCode
es: Para Instalar el VSCode

source: Desinstala o editor Sublime Text. (Este programa não é software livre)
es: Desinstala el editor Sublime Text. (Este programa no es software libre)

source: Remover o Sublime Text
es: Para quitar el Sublime Text

source: Instala o editor Sublime Text. (Este programa não é software livre)
es: Se Instala el editor Sublime Text. (Este programa no es software libre)

source: Instalar o Sublime Text
es: Para Instalar Sublime Text

source: Dicas de instalação e uso
es: Consejos de instalación y uso

source: Aguarde, instalando o servidor Apache.
es: Espera, instalando el servidor web Apache.

source: Aguarde...
es: Espera...

source: Aguarde, instalando o servidor MariaDB (Mysql).
es: Espera, instalando el servidor MariaDB (Mysql).

source: Aguarde, instalando o Phpmyadmin.
es: Espera, instalando el Phpmyadmin.

source: Escolha uma senha para o usuário admin do MariaDB (Mysql), não utilize aspas na senha:
es: Elija una contraseña para el usuario administrador de (Mysql), por favor no use comillas en la contraseña:

source: Próximo
es: El Próximo

source: Esse painel de configurações para servidores é feito para auxiliar pessoas que estão estudando sobre criação de sites, ou para servidores domésticos. Para o uso de servidores profissionais e empresariais é recomendado uma série de configurações extras, tanto de otimização de desempenho quanto de segurança. Ao instalar o servidor Apache, o PHP será instalado e configurado automaticamente. MariaDB e Mysql são compatíveis, portanto, os programas que necessitam de um desses bancos de dados, também funcionam no outro, utilizam os mesmos comandos etc. Para facilitar o uso do MariaDB, após a instalação, utilize a opção alterar a senha do usuário admin do MariaDB. Em alguns guias encontrados na internet, informam para utilizar o usuário root para gerenciar o MariaDB ou o Mysql, no nosso sistema o usuário admin possui os mesmos usos e recursos do usuário root. Instale também o Phpmyadmin para facilitar a criação e manutenção do banco de dados do seu servidor Mariadb. Para concluir, recomendo que você altere as permissões dos arquivos para o usuário atual, nas configurações do Apache, com isso basta acessar a pasta /var/www/html e criar os serviços web ou sites que você desejar.
es: Este panel de configuración del servidor está diseñado para ayudar a las personas que estudian la creación de sitios web o para servidores domésticos, para el uso de servidores profesionales y comerciales, una serie de configuraciones adicionales, tanto para la optimización del rendimiento como para la seguridad. Al instalar el servidor Apache, el PHP se instalará y configurará automáticamente. MariaDB y Mysql son compatibles, por lo tanto, los programas que necesitan una de estas bases de datos, también funciona en la otra, usa el mismos comandos y etc. Para facilitar el uso de MariaDB, después de la instalación, use la opción para cambiar el Contraseña de usuario administrador de MariaDB. En algunas guías que se encuentran en Internet, informan sobre el uso del usuario root para gestionar MariaDB o Mysql, en nuestro sistema el usuario admin tiene los mismos usos y recursos que el usuario root. También instale Phpmyadmin para facilitar la creación y el mantenimiento de su base de datos del servidor Mariadb. Para concluir, le recomiendo que cambie los permisos de archivo para el usuario actual, en la configuración de Apache, eso es suficiente acceda a la carpeta /var/www/html y cree los servicios web o sitios web que usted desea.

source: Servidor Web
es: El Servidor de WEB Apache

source: Aguarde, desinstalando o servidor Apache.
es: Espera, desinstalando el servidor web Apache.

source: Aguarde, desinstalando o servidor MariaDB (Mysql).
es: Espera, desinstalando el servidor MariaDB (Mysql).

source: Aguarde, desinstalando o Phpmyadmin.
es: Espere, desinstalando el Phpmyadmin.
